# CS-Det-N

# Parameters
nc: 10  # number of classes
depth_multiple: 1  # scales module repeats
width_multiple: 1  # scales convolution channels

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [32, 3, 2]]   # 1-P2/4
  - [-1, 1, IEPR, [32, 2, 2, True, "deepextend", 128]]
  - [-1, 1, IEPR, [32, 2, 2, True, "deepextend", 128]]
  - [-1, 1, IEPR, [32, 2, 2, True, "deepextend", 128]]
  - [-1, 1, Conv, [64, 3, 2]]   # 5-P3/8
  - [-1, 1, IEPR, [64, 2, 2, True, "deepextend", 256]]
  - [-1, 1, Conv, [128, 3, 2]]  # 7-P4/16
  - [-1, 1, IEPR, [128, 2, 2, True, "deepextend", 512]]
  - [-1, 1, SPPF, [128, 5]]     # 9

head:
  - [-1, 1, nn.Upsample, [None, 4, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]   # cat backbone P2
  - [-1, 1, IEPR, [32, 2, 2, False, "deepextend", 128]]  # 12 (P2/4-xsmall)

  - [-1, 1, Conv, [32, 3, 2]]
  - [-1, 1, Conv, [32, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]   # cat head P4
  - [-1, 1, IEPR, [128, 2, 2, False, "deepextend", 512]]  # 16 (P4/16-medium)

  - [[12, 16], 1, Detect, ["SiLU", "normal", nc]]         # Detect(P2, P4)
